# GetRoofComponents Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..GetRoofComponents Method
ExporterIFCUtils Class See Also
---
Gets the components of roof slabs.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static RoofComponents GetRoofComponents(
	ExporterIFC exporterIFC,
	RoofBase roof
)
```

Visual Basic
---
```text
Public Shared Function GetRoofComponents ( _
	exporterIFC As ExporterIFC, _
	roof As RoofBase _
) As RoofComponents
```

Visual C++
---
```text
public:
static RoofComponents^ GetRoofComponents(
	ExporterIFC^ exporterIFC,
	RoofBase^ roof
)
```

# ### Parameters
exporterIFC
    Type: Autodesk.Revit.DB.IFC..::..ExporterIFC The exporter.
roof
    Type: Autodesk.Revit.DB..::..RoofBase The roof element.
# ### Return Value
The roof components.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace